; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_17_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 - counter
	)
  (:init
		(= (value c0) 50)
	(= (value c1) 10)
	(= (value c2) 97)
	(= (value c3) 81)
	(= (value c4) 52)
	(= (value c5) 24)
	(= (value c6) 77)
	(= (value c7) 95)
	(= (value c8) 95)
	(= (value c9) 97)
	(= (value c10) 3)
	(= (value c11) 76)
	(= (value c12) 88)
	(= (value c13) 21)
	(= (value c14) 12)
	(= (value c15) 11)
	(= (value c16) 95)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
		)
	)
)

; plan
1. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 7 of 16
2. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 7 of 16
3. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 7 of 16
4. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 16
5. (increment c8)
   changed: (value c8) from 95 to 96
   goals met: 8 of 16
6. (decrement c14)
   changed: (value c14) from 12 to 10
   goals met: 9 of 16
7. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 9 of 16
8. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 9 of 16
9. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 9 of 16
10. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 9 of 16
11. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 9 of 16
12. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 9 of 16
13. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 9 of 16
14. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 9 of 16
15. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 9 of 16
16. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 9 of 16
17. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 9 of 16
18. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 9 of 16
19. (increment c14)
   changed: (value c14) from 10 to 16
   goals met: 8 of 16
20. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 8 of 16
21. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 8 of 16
22. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 8 of 16
23. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 8 of 16
24. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 8 of 16
25. (decrement c2)
   changed: (value c2) from 97 to 92
   goals met: 8 of 16
26. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 8 of 16
27. (decrement c2)
   changed: (value c2) from 92 to 86
   goals met: 8 of 16
28. (decrement c2)
   changed: (value c2) from 86 to 80
   goals met: 9 of 16
29. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 9 of 16
30. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 9 of 16
31. (increment c1)
   changed: (value c1) from 10 to 17
   goals met: 9 of 16
32. (increment c1)
   changed: (value c1) from 17 to 24
   goals met: 9 of 16
33. (increment c1)
   changed: (value c1) from 24 to 31
   goals met: 9 of 16
34. (increment c1)
   changed: (value c1) from 31 to 38
   goals met: 9 of 16
35. (increment c1)
   changed: (value c1) from 38 to 45
   goals met: 9 of 16
36. (increment c1)
   changed: (value c1) from 45 to 52
   goals met: 10 of 16
37. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 10 of 16
38. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 10 of 16
39. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 10 of 16
40. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 10 of 16
41. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 10 of 16
42. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 10 of 16
43. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 10 of 16
44. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 10 of 16
45. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 10 of 16
46. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 10 of 16
47. (decrement c14)
   changed: (value c14) from 16 to 10
   goals met: 11 of 16
48. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 11 of 16
49. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 11 of 16
50. (increment c13)
   changed: (value c13) from 21 to 29
   goals met: 11 of 16
51. (increment c14)
   changed: (value c14) from 10 to 16
   goals met: 10 of 16
52. (increase_rate c13)
   changed: (rate_value c13) from 8 to 9
   goals met: 10 of 16
53. (increment c13)
   changed: (value c13) from 29 to 38
   goals met: 10 of 16
54. (increment c13)
   changed: (value c13) from 38 to 47
   goals met: 10 of 16
55. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 10 of 16
56. (increase_rate c14)
   changed: (rate_value c14) from 7 to 8
   goals met: 10 of 16
57. (increase_rate c14)
   changed: (rate_value c14) from 8 to 9
   goals met: 10 of 16
58. (increase_rate c14)
   changed: (rate_value c14) from 9 to 10
   goals met: 10 of 16
59. (increment c13)
   changed: (value c13) from 47 to 56
   goals met: 10 of 16
60. (increment c13)
   changed: (value c13) from 56 to 65
   goals met: 10 of 16
61. (decrement c14)
   changed: (value c14) from 16 to 6
   goals met: 11 of 16
62. (increase_rate c13)
   changed: (rate_value c13) from 9 to 10
   goals met: 11 of 16
63. (increment c14)
   changed: (value c14) from 6 to 16
   goals met: 10 of 16
64. (increment c14)
   changed: (value c14) from 16 to 26
   goals met: 10 of 16
65. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 10 of 16
66. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 10 of 16
67. (increment c15)
   changed: (value c15) from 11 to 14
   goals met: 10 of 16
68. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 10 of 16
69. (decrement c12)
   changed: (value c12) from 88 to 83
   goals met: 10 of 16
70. (decrement c12)
   changed: (value c12) from 83 to 78
   goals met: 10 of 16
71. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 10 of 16
72. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 10 of 16
73. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 10 of 16
74. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 10 of 16
75. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 10 of 16
76. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 10 of 16
77. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 10 of 16
78. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 10 of 16
79. (increment c10)
   changed: (value c10) from 3 to 11
   goals met: 10 of 16
80. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 10 of 16
81. (increment c10)
   changed: (value c10) from 11 to 20
   goals met: 10 of 16
82. (increment c10)
   changed: (value c10) from 20 to 29
   goals met: 10 of 16
83. (increment c10)
   changed: (value c10) from 29 to 38
   goals met: 10 of 16
84. (increment c10)
   changed: (value c10) from 38 to 47
   goals met: 10 of 16
85. (increment c10)
   changed: (value c10) from 47 to 56
   goals met: 10 of 16
86. (increment c10)
   changed: (value c10) from 56 to 65
   goals met: 10 of 16
87. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 10 of 16
88. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 10 of 16
89. (increment c10)
   changed: (value c10) from 65 to 74
   goals met: 10 of 16
90. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 10 of 16
91. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 10 of 16
92. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 10 of 16
93. (increment c10)
   changed: (value c10) from 74 to 84
   goals met: 9 of 16
94. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 9 of 16
95. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 9 of 16
96. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 9 of 16
97. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 9 of 16
98. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 9 of 16
99. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 9 of 16
100. (increment c5)
   changed: (value c5) from 24 to 30
   goals met: 9 of 16
101. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 9 of 16
102. (increment c5)
   changed: (value c5) from 30 to 37
   goals met: 9 of 16
103. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 9 of 16
104. (increment c5)
   changed: (value c5) from 37 to 45
   goals met: 9 of 16
105. (increment c5)
   changed: (value c5) from 45 to 53
   goals met: 10 of 16
106. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 10 of 16
107. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 10 of 16
108. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 10 of 16
109. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 10 of 16
110. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 10 of 16
111. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 10 of 16
112. (increment c4)
   changed: (value c4) from 52 to 58
   goals met: 9 of 16
113. (increment c5)
   changed: (value c5) from 53 to 61
   goals met: 10 of 16
114. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 10 of 16
115. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 10 of 16
116. (increment c4)
   changed: (value c4) from 58 to 64
   goals met: 9 of 16
117. (increment c5)
   changed: (value c5) from 61 to 69
   goals met: 10 of 16
118. (increment c4)
   changed: (value c4) from 64 to 70
   goals met: 9 of 16
119. (increment c4)
   changed: (value c4) from 70 to 76
   goals met: 9 of 16
120. (increment c5)
   changed: (value c5) from 69 to 77
   goals met: 9 of 16
121. (increment c4)
   changed: (value c4) from 76 to 82
   goals met: 9 of 16
122. (increment c5)
   changed: (value c5) from 77 to 85
   goals met: 10 of 16
123. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 10 of 16
124. (increment c15)
   changed: (value c15) from 14 to 17
   goals met: 10 of 16
125. (increment c15)
   changed: (value c15) from 17 to 20
   goals met: 10 of 16
126. (increment c15)
   changed: (value c15) from 20 to 23
   goals met: 10 of 16
127. (increment c15)
   changed: (value c15) from 23 to 26
   goals met: 10 of 16
128. (increment c15)
   changed: (value c15) from 26 to 29
   goals met: 11 of 16
129. (increment c14)
   changed: (value c14) from 26 to 36
   goals met: 10 of 16
130. (increment c15)
   changed: (value c15) from 29 to 32
   goals met: 10 of 16
131. (increment c15)
   changed: (value c15) from 32 to 35
   goals met: 10 of 16
132. (increment c15)
   changed: (value c15) from 35 to 38
   goals met: 11 of 16
133. (increment c13)
   changed: (value c13) from 65 to 75
   goals met: 11 of 16
134. (decrement c12)
   changed: (value c12) from 78 to 73
   goals met: 11 of 16
135. (increment c14)
   changed: (value c14) from 36 to 46
   goals met: 10 of 16
136. (increment c15)
   changed: (value c15) from 38 to 41
   goals met: 10 of 16
137. (increment c15)
   changed: (value c15) from 41 to 44
   goals met: 10 of 16
138. (increment c15)
   changed: (value c15) from 44 to 47
   goals met: 11 of 16
139. (increment c12)
   changed: (value c12) from 73 to 78
   goals met: 11 of 16
140. (increment c13)
   changed: (value c13) from 75 to 85
   goals met: 12 of 16
141. (increment c14)
   changed: (value c14) from 46 to 56
   goals met: 11 of 16
142. (increment c15)
   changed: (value c15) from 47 to 50
   goals met: 11 of 16
143. (increment c15)
   changed: (value c15) from 50 to 53
   goals met: 11 of 16
144. (increment c15)
   changed: (value c15) from 53 to 56
   goals met: 11 of 16
145. (increment c15)
   changed: (value c15) from 56 to 59
   goals met: 12 of 16
146. (decrement c13)
   changed: (value c13) from 85 to 75
   goals met: 11 of 16
147. (decrement c12)
   changed: (value c12) from 78 to 73
   goals met: 11 of 16
148. (increment c14)
   changed: (value c14) from 56 to 66
   goals met: 10 of 16
149. (increment c15)
   changed: (value c15) from 59 to 62
   goals met: 10 of 16
150. (increment c15)
   changed: (value c15) from 62 to 65
   goals met: 10 of 16
151. (increment c15)
   changed: (value c15) from 65 to 68
   goals met: 11 of 16
152. (increment c12)
   changed: (value c12) from 73 to 78
   goals met: 11 of 16
153. (increment c13)
   changed: (value c13) from 75 to 85
   goals met: 12 of 16
154. (increment c14)
   changed: (value c14) from 66 to 76
   goals met: 11 of 16
155. (increment c15)
   changed: (value c15) from 68 to 71
   goals met: 11 of 16
156. (increment c15)
   changed: (value c15) from 71 to 74
   goals met: 11 of 16
157. (increment c15)
   changed: (value c15) from 74 to 77
   goals met: 12 of 16
158. (increment c14)
   changed: (value c14) from 76 to 86
   goals met: 12 of 16
159. (increment c15)
   changed: (value c15) from 77 to 80
   goals met: 12 of 16
160. (increment c15)
   changed: (value c15) from 80 to 83
   goals met: 12 of 16
161. (increment c15)
   changed: (value c15) from 83 to 86
   goals met: 12 of 16
162. (increment c15)
   changed: (value c15) from 86 to 89
   goals met: 13 of 16
163. (decrement c5)
   changed: (value c5) from 85 to 76
   goals met: 13 of 16
164. (decrement c4)
   changed: (value c4) from 82 to 76
   goals met: 12 of 16
165. (decrement c4)
   changed: (value c4) from 76 to 70
   goals met: 13 of 16
166. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 13 of 16
167. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 13 of 16
168. (decrement c3)
   changed: (value c3) from 81 to 77
   goals met: 12 of 16
169. (decrement c3)
   changed: (value c3) from 77 to 73
   goals met: 12 of 16
170. (decrement c3)
   changed: (value c3) from 73 to 69
   goals met: 13 of 16
171. (decrement c2)
   changed: (value c2) from 80 to 74
   goals met: 13 of 16
172. (decrement c2)
   changed: (value c2) from 74 to 68
   goals met: 14 of 16
173. (decrement c10)
   changed: (value c10) from 84 to 74
   goals met: 15 of 16
174. (decrement c9)
   changed: (value c9) from 97 to 93
   goals met: 14 of 16
175. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 14 of 16
176. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 14 of 16
177. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 14 of 16
178. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 14 of 16
179. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 14 of 16
180. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 14 of 16
181. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 14 of 16
182. (decrement c8)
   changed: (value c8) from 96 to 94
   goals met: 13 of 16
183. (decrement c8)
   changed: (value c8) from 94 to 92
   goals met: 14 of 16
184. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 14 of 16
185. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 14 of 16
186. (decrement c7)
   changed: (value c7) from 95 to 93
   goals met: 14 of 16
187. (decrement c7)
   changed: (value c7) from 93 to 91
   goals met: 15 of 16
188. (increment c10)
   changed: (value c10) from 74 to 84
   goals met: 14 of 16
189. (decrement c9)
   changed: (value c9) from 93 to 83
   goals met: 14 of 16
190. (decrement c8)
   changed: (value c8) from 92 to 90
   goals met: 13 of 16
191. (decrement c8)
   changed: (value c8) from 90 to 88
   goals met: 13 of 16
192. (decrement c8)
   changed: (value c8) from 88 to 86
   goals met: 13 of 16
193. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 13 of 16
194. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 13 of 16
195. (decrement c8)
   changed: (value c8) from 86 to 84
   goals met: 13 of 16
196. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 13 of 16
197. (decrement c8)
   changed: (value c8) from 84 to 82
   goals met: 14 of 16
198. (decrement c7)
   changed: (value c7) from 91 to 86
   goals met: 14 of 16
199. (decrement c7)
   changed: (value c7) from 86 to 81
   goals met: 15 of 16
200. (decrement c10)
   changed: (value c10) from 84 to 74
   goals met: 15 of 16
201. (decrement c9)
   changed: (value c9) from 83 to 73
   goals met: 15 of 16
202. (decrement c8)
   changed: (value c8) from 82 to 80
   goals met: 14 of 16
203. (decrement c8)
   changed: (value c8) from 80 to 78
   goals met: 14 of 16
204. (decrement c8)
   changed: (value c8) from 78 to 76
   goals met: 14 of 16
205. (decrement c8)
   changed: (value c8) from 76 to 74
   goals met: 14 of 16
206. (decrement c8)
   changed: (value c8) from 74 to 72
   goals met: 15 of 16
207. (decrement c7)
   changed: (value c7) from 81 to 76
   goals met: 14 of 16
208. (decrement c7)
   changed: (value c7) from 76 to 71
   goals met: 15 of 16
209. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 15 of 16
210. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 15 of 16
211. (decrement c6)
   changed: (value c6) from 77 to 75
   goals met: 14 of 16
212. (decrement c6)
   changed: (value c6) from 75 to 73
   goals met: 14 of 16
213. (decrement c6)
   changed: (value c6) from 73 to 71
   goals met: 14 of 16
214. (decrement c6)
   changed: (value c6) from 71 to 69
   goals met: 15 of 16
215. (decrement c5)
   changed: (value c5) from 76 to 67
   goals met: 15 of 16
216. (decrement c4)
   changed: (value c4) from 70 to 64
   goals met: 15 of 16
217. (decrement c3)
   changed: (value c3) from 69 to 65
   goals met: 14 of 16
218. (decrement c3)
   changed: (value c3) from 65 to 61
   goals met: 15 of 16
219. (decrement c2)
   changed: (value c2) from 68 to 62
   goals met: 15 of 16
220. (decrement c2)
   changed: (value c2) from 62 to 56
   goals met: 16 of 16
